Revit 2027 API
Document.NewSpaces2(Level, Phase, View) Method
 Creates new spaces on the available plan circuits of a the given level.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> NewSpaces2(
	Level level,
	Phase phase,
	View view
)
Public Function NewSpaces2 (
	level As Level,
	phase As Phase,
	view As View
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ NewSpaces2(
	Level^ level,
	Phase^ phase,
	View^ view
)
member NewSpaces2 :
        level : Level *
        phase : Phase *
        view : View -> ICollection<ElementId>
Parameters
level Level
 The level on which the spaces is to exist.
phase Phase
 The phase in which the spaces is to exist.
view View
 The view on which the space tags for the spaces are to display.
Return Value
ICollection<ElementId>
 If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | The view of the relevant level can not be retrieved.
InvalidOperationException | The phase is invalid or regeneration fails at the end of the creation.
ArgumentException | Thrown if the level does not exist in the given document.
ArgumentException | Thrown if the phase does not exist in the given document.
ArgumentException | Thrown if the view does not exist in the given document.
Remarks
 This method will regenerate the document even in manual regeneration mode.
See Also
Reference
Document Class
NewSpaces2 Overload
Autodesk.Revit.Creation Namespace